app/controllers/todos_controller.rb

  def create
  	@todo = Todo.new(params[:todo])
  	if @todo.save
---
INSERT INTO "todos" ("description", "name") VALUES (?, ?)  [["description", "sourav is lazy."], ["name", "sourav"]]

  def edit
    @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @todo = Todo.find(params[:id])
    if @todo.update_attributes(params[:todo])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "todos" SET "description" = 'sourav is lazy and not serious to himself.' WHERE "todos"."id" = 2

  def destroy
    todo = Todo.find(params[:id])
    todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]